tests/Mock/ideal_refund_success_response.txt

HTTP/1.1 200 OK
Content-Type: application/json

{"Key":"FF1EB73EADC34B079BF1A525FA657D41","Status":{"Code":{"Code":190,"Description":"Success"},"SubCode":{"Code":"S001","Description":"Transaction successfully processed"},"DateTime":"2022-03-26T12:12:59"},"RequiredAction":null,"Services":[{"Name":"ideal","Action":null,"Parameters":[{"Name":"customeraccountname","Value":"J. de Tèster"},{"Name":"CustomerIBAN","Value":"NL44RABO0123456789"},{"Name":"CustomerBIC","Value":"RABONL2U"}]}],"CustomParameters":null,"AdditionalParameters":null,"RequestErrors":null,"Invoice":"Ideal_Test_1648289452","ServiceCode":"ideal","IsTest":true,"Currency":"EUR","AmountCredit":0.01,"TransactionType":"C121","MutationType":1,"RelatedTransactions":[{"RelationType":"refund","RelatedTransactionKey":"3C9C00766C584523AC04A9523F946523"}],"ConsumerMessage":null,"Order":null,"IssuingCountry":null,"StartRecurrent":false,"Recurring":false,"CustomerName":"J. de Tèster","PayerHash":null,"PaymentKey":"906034773E084F09B20C44A2E40F3AA0"}